____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, None, None, 3) 0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, None, None, 32)0           input_1[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNormal(None, None, None, 32)0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, None, None, 32)0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
batchnormalization_2 (BatchNormal(None, None, None, 32)0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, None, None, 64)0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
batchnormalization_3 (BatchNormal(None, None, None, 64)0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, None, None, 64)0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, None, None, 80)0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
batchnormalization_4 (BatchNormal(None, None, None, 80)0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, None, None, 1920           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
batchnormalization_5 (BatchNormal(None, None, None, 1920           convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, None, None, 1920           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, None, None, 64)0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
batchnormalization_9 (BatchNormal(None, None, None, 64)0           convolution2d_9[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, None, None, 48)0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, None, None, 96)0           batchnormalization_9[0][0]       
____________________________________________________________________________________________________
batchnormalization_7 (BatchNormal(None, None, None, 48)0           convolution2d_7[0][0]            
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorma(None, None, None, 96)0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
averagepooling2d_1 (AveragePoolin(None, None, None, 1920           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, None, None, 64)0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, None, None, 64)0           batchnormalization_7[0][0]       
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, None, None, 96)0           batchnormalization_10[0][0]      
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, None, None, 32)0           averagepooling2d_1[0][0]         
____________________________________________________________________________________________________
batchnormalization_6 (BatchNormal(None, None, None, 64)0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
batchnormalization_8 (BatchNormal(None, None, None, 64)0           convolution2d_8[0][0]            
____________________________________________________________________________________________________
batchnormalization_11 (BatchNorma(None, None, None, 96)0           convolution2d_11[0][0]           
____________________________________________________________________________________________________
batchnormalization_12 (BatchNorma(None, None, None, 32)0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
mixed0 (Merge)                   (None, None, None, 2560           batchnormalization_6[0][0]       
                                                                   batchnormalization_8[0][0]       
                                                                   batchnormalization_11[0][0]      
                                                                   batchnormalization_12[0][0]      
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, None, None, 64)0           mixed0[0][0]                     
____________________________________________________________________________________________________
batchnormalization_16 (BatchNorma(None, None, None, 64)0           convolution2d_16[0][0]           
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, None, None, 48)0           mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, None, None, 96)0           batchnormalization_16[0][0]      
____________________________________________________________________________________________________
batchnormalization_14 (BatchNorma(None, None, None, 48)0           convolution2d_14[0][0]           
____________________________________________________________________________________________________
batchnormalization_17 (BatchNorma(None, None, None, 96)0           convolution2d_17[0][0]           
____________________________________________________________________________________________________
averagepooling2d_2 (AveragePoolin(None, None, None, 2560           mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, None, None, 64)0           mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, None, None, 64)0           batchnormalization_14[0][0]      
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, None, None, 96)0           batchnormalization_17[0][0]      
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, None, None, 32)0           averagepooling2d_2[0][0]         
____________________________________________________________________________________________________
batchnormalization_13 (BatchNorma(None, None, None, 64)0           convolution2d_13[0][0]           
____________________________________________________________________________________________________
batchnormalization_15 (BatchNorma(None, None, None, 64)0           convolution2d_15[0][0]           
____________________________________________________________________________________________________
batchnormalization_18 (BatchNorma(None, None, None, 96)0           convolution2d_18[0][0]           
____________________________________________________________________________________________________
batchnormalization_19 (BatchNorma(None, None, None, 32)0           convolution2d_19[0][0]           
____________________________________________________________________________________________________
mixed1 (Merge)                   (None, None, None, 2560           batchnormalization_13[0][0]      
                                                                   batchnormalization_15[0][0]      
                                                                   batchnormalization_18[0][0]      
                                                                   batchnormalization_19[0][0]      
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D) (None, None, None, 64)0           mixed1[0][0]                     
____________________________________________________________________________________________________
batchnormalization_23 (BatchNorma(None, None, None, 64)0           convolution2d_23[0][0]           
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D) (None, None, None, 48)0           mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D) (None, None, None, 96)0           batchnormalization_23[0][0]      
____________________________________________________________________________________________________
batchnormalization_21 (BatchNorma(None, None, None, 48)0           convolution2d_21[0][0]           
____________________________________________________________________________________________________
batchnormalization_24 (BatchNorma(None, None, None, 96)0           convolution2d_24[0][0]           
____________________________________________________________________________________________________
averagepooling2d_3 (AveragePoolin(None, None, None, 2560           mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D) (None, None, None, 64)0           mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D) (None, None, None, 64)0           batchnormalization_21[0][0]      
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D) (None, None, None, 96)0           batchnormalization_24[0][0]      
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D) (None, None, None, 32)0           averagepooling2d_3[0][0]         
____________________________________________________________________________________________________
batchnormalization_20 (BatchNorma(None, None, None, 64)0           convolution2d_20[0][0]           
____________________________________________________________________________________________________
batchnormalization_22 (BatchNorma(None, None, None, 64)0           convolution2d_22[0][0]           
____________________________________________________________________________________________________
batchnormalization_25 (BatchNorma(None, None, None, 96)0           convolution2d_25[0][0]           
____________________________________________________________________________________________________
batchnormalization_26 (BatchNorma(None, None, None, 32)0           convolution2d_26[0][0]           
____________________________________________________________________________________________________
mixed2 (Merge)                   (None, None, None, 2560           batchnormalization_20[0][0]      
                                                                   batchnormalization_22[0][0]      
                                                                   batchnormalization_25[0][0]      
                                                                   batchnormalization_26[0][0]      
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D) (None, None, None, 64)0           mixed2[0][0]                     
____________________________________________________________________________________________________
batchnormalization_28 (BatchNorma(None, None, None, 64)0           convolution2d_28[0][0]           
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D) (None, None, None, 96)0           batchnormalization_28[0][0]      
____________________________________________________________________________________________________
batchnormalization_29 (BatchNorma(None, None, None, 96)0           convolution2d_29[0][0]           
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D) (None, None, None, 3840           mixed2[0][0]                     
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D) (None, None, None, 96)0           batchnormalization_29[0][0]      
____________________________________________________________________________________________________
batchnormalization_27 (BatchNorma(None, None, None, 3840           convolution2d_27[0][0]           
____________________________________________________________________________________________________
batchnormalization_30 (BatchNorma(None, None, None, 96)0           convolution2d_30[0][0]           
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, None, None, 2560           mixed2[0][0]                     
____________________________________________________________________________________________________
mixed3 (Merge)                   (None, None, None, 7360           batchnormalization_27[0][0]      
                                                                   batchnormalization_30[0][0]      
                                                                   maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_35 (Convolution2D) (None, None, None, 1280           mixed3[0][0]                     
____________________________________________________________________________________________________
batchnormalization_35 (BatchNorma(None, None, None, 1280           convolution2d_35[0][0]           
____________________________________________________________________________________________________
convolution2d_36 (Convolution2D) (None, None, None, 1280           batchnormalization_35[0][0]      
____________________________________________________________________________________________________
batchnormalization_36 (BatchNorma(None, None, None, 1280           convolution2d_36[0][0]           
____________________________________________________________________________________________________
convolution2d_32 (Convolution2D) (None, None, None, 1280           mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_37 (Convolution2D) (None, None, None, 1280           batchnormalization_36[0][0]      
____________________________________________________________________________________________________
batchnormalization_32 (BatchNorma(None, None, None, 1280           convolution2d_32[0][0]           
____________________________________________________________________________________________________
batchnormalization_37 (BatchNorma(None, None, None, 1280           convolution2d_37[0][0]           
____________________________________________________________________________________________________
convolution2d_33 (Convolution2D) (None, None, None, 1280           batchnormalization_32[0][0]      
____________________________________________________________________________________________________
convolution2d_38 (Convolution2D) (None, None, None, 1280           batchnormalization_37[0][0]      
____________________________________________________________________________________________________
batchnormalization_33 (BatchNorma(None, None, None, 1280           convolution2d_33[0][0]           
____________________________________________________________________________________________________
batchnormalization_38 (BatchNorma(None, None, None, 1280           convolution2d_38[0][0]           
____________________________________________________________________________________________________
averagepooling2d_4 (AveragePoolin(None, None, None, 7360           mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_31 (Convolution2D) (None, None, None, 1920           mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_34 (Convolution2D) (None, None, None, 1920           batchnormalization_33[0][0]      
____________________________________________________________________________________________________
convolution2d_39 (Convolution2D) (None, None, None, 1920           batchnormalization_38[0][0]      
____________________________________________________________________________________________________
convolution2d_40 (Convolution2D) (None, None, None, 1920           averagepooling2d_4[0][0]         
____________________________________________________________________________________________________
batchnormalization_31 (BatchNorma(None, None, None, 1920           convolution2d_31[0][0]           
____________________________________________________________________________________________________
batchnormalization_34 (BatchNorma(None, None, None, 1920           convolution2d_34[0][0]           
____________________________________________________________________________________________________
batchnormalization_39 (BatchNorma(None, None, None, 1920           convolution2d_39[0][0]           
____________________________________________________________________________________________________
batchnormalization_40 (BatchNorma(None, None, None, 1920           convolution2d_40[0][0]           
____________________________________________________________________________________________________
mixed4 (Merge)                   (None, None, None, 7680           batchnormalization_31[0][0]      
                                                                   batchnormalization_34[0][0]      
                                                                   batchnormalization_39[0][0]      
                                                                   batchnormalization_40[0][0]      
____________________________________________________________________________________________________
convolution2d_45 (Convolution2D) (None, None, None, 1600           mixed4[0][0]                     
____________________________________________________________________________________________________
batchnormalization_45 (BatchNorma(None, None, None, 1600           convolution2d_45[0][0]           
____________________________________________________________________________________________________
convolution2d_46 (Convolution2D) (None, None, None, 1600           batchnormalization_45[0][0]      
____________________________________________________________________________________________________
batchnormalization_46 (BatchNorma(None, None, None, 1600           convolution2d_46[0][0]           
____________________________________________________________________________________________________
convolution2d_42 (Convolution2D) (None, None, None, 1600           mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_47 (Convolution2D) (None, None, None, 1600           batchnormalization_46[0][0]      
____________________________________________________________________________________________________
batchnormalization_42 (BatchNorma(None, None, None, 1600           convolution2d_42[0][0]           
____________________________________________________________________________________________________
batchnormalization_47 (BatchNorma(None, None, None, 1600           convolution2d_47[0][0]           
____________________________________________________________________________________________________
convolution2d_43 (Convolution2D) (None, None, None, 1600           batchnormalization_42[0][0]      
____________________________________________________________________________________________________
convolution2d_48 (Convolution2D) (None, None, None, 1600           batchnormalization_47[0][0]      
____________________________________________________________________________________________________
batchnormalization_43 (BatchNorma(None, None, None, 1600           convolution2d_43[0][0]           
____________________________________________________________________________________________________
batchnormalization_48 (BatchNorma(None, None, None, 1600           convolution2d_48[0][0]           
____________________________________________________________________________________________________
averagepooling2d_5 (AveragePoolin(None, None, None, 7680           mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_41 (Convolution2D) (None, None, None, 1920           mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_44 (Convolution2D) (None, None, None, 1920           batchnormalization_43[0][0]      
____________________________________________________________________________________________________
convolution2d_49 (Convolution2D) (None, None, None, 1920           batchnormalization_48[0][0]      
____________________________________________________________________________________________________
convolution2d_50 (Convolution2D) (None, None, None, 1920           averagepooling2d_5[0][0]         
____________________________________________________________________________________________________
batchnormalization_41 (BatchNorma(None, None, None, 1920           convolution2d_41[0][0]           
____________________________________________________________________________________________________
batchnormalization_44 (BatchNorma(None, None, None, 1920           convolution2d_44[0][0]           
____________________________________________________________________________________________________
batchnormalization_49 (BatchNorma(None, None, None, 1920           convolution2d_49[0][0]           
____________________________________________________________________________________________________
batchnormalization_50 (BatchNorma(None, None, None, 1920           convolution2d_50[0][0]           
____________________________________________________________________________________________________
mixed5 (Merge)                   (None, None, None, 7680           batchnormalization_41[0][0]      
                                                                   batchnormalization_44[0][0]      
                                                                   batchnormalization_49[0][0]      
                                                                   batchnormalization_50[0][0]      
____________________________________________________________________________________________________
convolution2d_55 (Convolution2D) (None, None, None, 1600           mixed5[0][0]                     
____________________________________________________________________________________________________
batchnormalization_55 (BatchNorma(None, None, None, 1600           convolution2d_55[0][0]           
____________________________________________________________________________________________________
convolution2d_56 (Convolution2D) (None, None, None, 1600           batchnormalization_55[0][0]      
____________________________________________________________________________________________________
batchnormalization_56 (BatchNorma(None, None, None, 1600           convolution2d_56[0][0]           
____________________________________________________________________________________________________
convolution2d_52 (Convolution2D) (None, None, None, 1600           mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_57 (Convolution2D) (None, None, None, 1600           batchnormalization_56[0][0]      
____________________________________________________________________________________________________
batchnormalization_52 (BatchNorma(None, None, None, 1600           convolution2d_52[0][0]           
____________________________________________________________________________________________________
batchnormalization_57 (BatchNorma(None, None, None, 1600           convolution2d_57[0][0]           
____________________________________________________________________________________________________
convolution2d_53 (Convolution2D) (None, None, None, 1600           batchnormalization_52[0][0]      
____________________________________________________________________________________________________
convolution2d_58 (Convolution2D) (None, None, None, 1600           batchnormalization_57[0][0]      
____________________________________________________________________________________________________
batchnormalization_53 (BatchNorma(None, None, None, 1600           convolution2d_53[0][0]           
____________________________________________________________________________________________________
batchnormalization_58 (BatchNorma(None, None, None, 1600           convolution2d_58[0][0]           
____________________________________________________________________________________________________
averagepooling2d_6 (AveragePoolin(None, None, None, 7680           mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_51 (Convolution2D) (None, None, None, 1920           mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_54 (Convolution2D) (None, None, None, 1920           batchnormalization_53[0][0]      
____________________________________________________________________________________________________
convolution2d_59 (Convolution2D) (None, None, None, 1920           batchnormalization_58[0][0]      
____________________________________________________________________________________________________
convolution2d_60 (Convolution2D) (None, None, None, 1920           averagepooling2d_6[0][0]         
____________________________________________________________________________________________________
batchnormalization_51 (BatchNorma(None, None, None, 1920           convolution2d_51[0][0]           
____________________________________________________________________________________________________
batchnormalization_54 (BatchNorma(None, None, None, 1920           convolution2d_54[0][0]           
____________________________________________________________________________________________________
batchnormalization_59 (BatchNorma(None, None, None, 1920           convolution2d_59[0][0]           
____________________________________________________________________________________________________
batchnormalization_60 (BatchNorma(None, None, None, 1920           convolution2d_60[0][0]           
____________________________________________________________________________________________________
mixed6 (Merge)                   (None, None, None, 7680           batchnormalization_51[0][0]      
                                                                   batchnormalization_54[0][0]      
                                                                   batchnormalization_59[0][0]      
                                                                   batchnormalization_60[0][0]      
____________________________________________________________________________________________________
convolution2d_65 (Convolution2D) (None, None, None, 1600           mixed6[0][0]                     
____________________________________________________________________________________________________
batchnormalization_65 (BatchNorma(None, None, None, 1600           convolution2d_65[0][0]           
____________________________________________________________________________________________________
convolution2d_66 (Convolution2D) (None, None, None, 1920           batchnormalization_65[0][0]      
____________________________________________________________________________________________________
batchnormalization_66 (BatchNorma(None, None, None, 1920           convolution2d_66[0][0]           
____________________________________________________________________________________________________
convolution2d_62 (Convolution2D) (None, None, None, 1920           mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_67 (Convolution2D) (None, None, None, 1920           batchnormalization_66[0][0]      
____________________________________________________________________________________________________
batchnormalization_62 (BatchNorma(None, None, None, 1920           convolution2d_62[0][0]           
____________________________________________________________________________________________________
batchnormalization_67 (BatchNorma(None, None, None, 1920           convolution2d_67[0][0]           
____________________________________________________________________________________________________
convolution2d_63 (Convolution2D) (None, None, None, 1920           batchnormalization_62[0][0]      
____________________________________________________________________________________________________
convolution2d_68 (Convolution2D) (None, None, None, 1920           batchnormalization_67[0][0]      
____________________________________________________________________________________________________
batchnormalization_63 (BatchNorma(None, None, None, 1920           convolution2d_63[0][0]           
____________________________________________________________________________________________________
batchnormalization_68 (BatchNorma(None, None, None, 1920           convolution2d_68[0][0]           
____________________________________________________________________________________________________
averagepooling2d_7 (AveragePoolin(None, None, None, 7680           mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_61 (Convolution2D) (None, None, None, 1920           mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_64 (Convolution2D) (None, None, None, 1920           batchnormalization_63[0][0]      
____________________________________________________________________________________________________
convolution2d_69 (Convolution2D) (None, None, None, 1920           batchnormalization_68[0][0]      
____________________________________________________________________________________________________
convolution2d_70 (Convolution2D) (None, None, None, 1920           averagepooling2d_7[0][0]         
____________________________________________________________________________________________________
batchnormalization_61 (BatchNorma(None, None, None, 1920           convolution2d_61[0][0]           
____________________________________________________________________________________________________
batchnormalization_64 (BatchNorma(None, None, None, 1920           convolution2d_64[0][0]           
____________________________________________________________________________________________________
batchnormalization_69 (BatchNorma(None, None, None, 1920           convolution2d_69[0][0]           
____________________________________________________________________________________________________
batchnormalization_70 (BatchNorma(None, None, None, 1920           convolution2d_70[0][0]           
____________________________________________________________________________________________________
mixed7 (Merge)                   (None, None, None, 7680           batchnormalization_61[0][0]      
                                                                   batchnormalization_64[0][0]      
                                                                   batchnormalization_69[0][0]      
                                                                   batchnormalization_70[0][0]      
____________________________________________________________________________________________________
convolution2d_73 (Convolution2D) (None, None, None, 1920           mixed7[0][0]                     
____________________________________________________________________________________________________
batchnormalization_73 (BatchNorma(None, None, None, 1920           convolution2d_73[0][0]           
____________________________________________________________________________________________________
convolution2d_74 (Convolution2D) (None, None, None, 1920           batchnormalization_73[0][0]      
____________________________________________________________________________________________________
batchnormalization_74 (BatchNorma(None, None, None, 1920           convolution2d_74[0][0]           
____________________________________________________________________________________________________
convolution2d_71 (Convolution2D) (None, None, None, 1920           mixed7[0][0]                     
____________________________________________________________________________________________________
convolution2d_75 (Convolution2D) (None, None, None, 1920           batchnormalization_74[0][0]      
____________________________________________________________________________________________________
batchnormalization_71 (BatchNorma(None, None, None, 1920           convolution2d_71[0][0]           
____________________________________________________________________________________________________
batchnormalization_75 (BatchNorma(None, None, None, 1920           convolution2d_75[0][0]           
____________________________________________________________________________________________________
convolution2d_72 (Convolution2D) (None, None, None, 3200           batchnormalization_71[0][0]      
____________________________________________________________________________________________________
convolution2d_76 (Convolution2D) (None, None, None, 1920           batchnormalization_75[0][0]      
____________________________________________________________________________________________________
batchnormalization_72 (BatchNorma(None, None, None, 3200           convolution2d_72[0][0]           
____________________________________________________________________________________________________
batchnormalization_76 (BatchNorma(None, None, None, 1920           convolution2d_76[0][0]           
____________________________________________________________________________________________________
averagepooling2d_8 (AveragePoolin(None, None, None, 7680           mixed7[0][0]                     
____________________________________________________________________________________________________
mixed8 (Merge)                   (None, None, None, 1280           batchnormalization_72[0][0]      
                                                                   batchnormalization_76[0][0]      
                                                                   averagepooling2d_8[0][0]         
____________________________________________________________________________________________________
convolution2d_81 (Convolution2D) (None, None, None, 4480           mixed8[0][0]                     
____________________________________________________________________________________________________
batchnormalization_81 (BatchNorma(None, None, None, 4480           convolution2d_81[0][0]           
____________________________________________________________________________________________________
convolution2d_78 (Convolution2D) (None, None, None, 3840           mixed8[0][0]                     
____________________________________________________________________________________________________
convolution2d_82 (Convolution2D) (None, None, None, 3840           batchnormalization_81[0][0]      
____________________________________________________________________________________________________
batchnormalization_78 (BatchNorma(None, None, None, 3840           convolution2d_78[0][0]           
____________________________________________________________________________________________________
batchnormalization_82 (BatchNorma(None, None, None, 3840           convolution2d_82[0][0]           
____________________________________________________________________________________________________
convolution2d_79 (Convolution2D) (None, None, None, 3840           batchnormalization_78[0][0]      
____________________________________________________________________________________________________
convolution2d_80 (Convolution2D) (None, None, None, 3840           batchnormalization_78[0][0]      
____________________________________________________________________________________________________
convolution2d_83 (Convolution2D) (None, None, None, 3840           batchnormalization_82[0][0]      
____________________________________________________________________________________________________
convolution2d_84 (Convolution2D) (None, None, None, 3840           batchnormalization_82[0][0]      
____________________________________________________________________________________________________
averagepooling2d_9 (AveragePoolin(None, None, None, 1280           mixed8[0][0]                     
____________________________________________________________________________________________________
convolution2d_77 (Convolution2D) (None, None, None, 3200           mixed8[0][0]                     
____________________________________________________________________________________________________
batchnormalization_79 (BatchNorma(None, None, None, 3840           convolution2d_79[0][0]           
____________________________________________________________________________________________________
batchnormalization_80 (BatchNorma(None, None, None, 3840           convolution2d_80[0][0]           
____________________________________________________________________________________________________
batchnormalization_83 (BatchNorma(None, None, None, 3840           convolution2d_83[0][0]           
____________________________________________________________________________________________________
batchnormalization_84 (BatchNorma(None, None, None, 3840           convolution2d_84[0][0]           
____________________________________________________________________________________________________
convolution2d_85 (Convolution2D) (None, None, None, 1920           averagepooling2d_9[0][0]         
____________________________________________________________________________________________________
batchnormalization_77 (BatchNorma(None, None, None, 3200           convolution2d_77[0][0]           
____________________________________________________________________________________________________
mixed9_0 (Merge)                 (None, None, None, 7680           batchnormalization_79[0][0]      
                                                                   batchnormalization_80[0][0]      
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, None, None, 7680           batchnormalization_83[0][0]      
                                                                   batchnormalization_84[0][0]      
____________________________________________________________________________________________________
batchnormalization_85 (BatchNorma(None, None, None, 1920           convolution2d_85[0][0]           
____________________________________________________________________________________________________
mixed9 (Merge)                   (None, None, None, 2040           batchnormalization_77[0][0]      
                                                                   mixed9_0[0][0]                   
                                                                   merge_1[0][0]                    
                                                                   batchnormalization_85[0][0]      
____________________________________________________________________________________________________
convolution2d_90 (Convolution2D) (None, None, None, 4480           mixed9[0][0]                     
____________________________________________________________________________________________________
batchnormalization_90 (BatchNorma(None, None, None, 4480           convolution2d_90[0][0]           
____________________________________________________________________________________________________
convolution2d_87 (Convolution2D) (None, None, None, 3840           mixed9[0][0]                     
____________________________________________________________________________________________________
convolution2d_91 (Convolution2D) (None, None, None, 3840           batchnormalization_90[0][0]      
____________________________________________________________________________________________________
batchnormalization_87 (BatchNorma(None, None, None, 3840           convolution2d_87[0][0]           
____________________________________________________________________________________________________
batchnormalization_91 (BatchNorma(None, None, None, 3840           convolution2d_91[0][0]           
____________________________________________________________________________________________________
convolution2d_88 (Convolution2D) (None, None, None, 3840           batchnormalization_87[0][0]      
____________________________________________________________________________________________________
convolution2d_89 (Convolution2D) (None, None, None, 3840           batchnormalization_87[0][0]      
____________________________________________________________________________________________________
convolution2d_92 (Convolution2D) (None, None, None, 3840           batchnormalization_91[0][0]      
____________________________________________________________________________________________________
convolution2d_93 (Convolution2D) (None, None, None, 3840           batchnormalization_91[0][0]      
____________________________________________________________________________________________________
averagepooling2d_10 (AveragePooli(None, None, None, 2040           mixed9[0][0]                     
____________________________________________________________________________________________________
convolution2d_86 (Convolution2D) (None, None, None, 3200           mixed9[0][0]                     
____________________________________________________________________________________________________
batchnormalization_88 (BatchNorma(None, None, None, 3840           convolution2d_88[0][0]           
____________________________________________________________________________________________________
batchnormalization_89 (BatchNorma(None, None, None, 3840           convolution2d_89[0][0]           
____________________________________________________________________________________________________
batchnormalization_92 (BatchNorma(None, None, None, 3840           convolution2d_92[0][0]           
____________________________________________________________________________________________________
batchnormalization_93 (BatchNorma(None, None, None, 3840           convolution2d_93[0][0]           
____________________________________________________________________________________________________
convolution2d_94 (Convolution2D) (None, None, None, 1920           averagepooling2d_10[0][0]        
____________________________________________________________________________________________________
batchnormalization_86 (BatchNorma(None, None, None, 3200           convolution2d_86[0][0]           
____________________________________________________________________________________________________
mixed9_1 (Merge)                 (None, None, None, 7680           batchnormalization_88[0][0]      
                                                                   batchnormalization_89[0][0]      
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, None, None, 7680           batchnormalization_92[0][0]      
                                                                   batchnormalization_93[0][0]      
____________________________________________________________________________________________________
batchnormalization_94 (BatchNorma(None, None, None, 1920           convolution2d_94[0][0]           
____________________________________________________________________________________________________
mixed10 (Merge)                  (None, None, None, 2040           batchnormalization_86[0][0]      
                                                                   mixed9_1[0][0]                   
                                                                   merge_2[0][0]                    
                                                                   batchnormalization_94[0][0]      
____________________________________________________________________________________________________
globalaveragepooling2d_1 (GlobalA(None, 2048)          0           mixed10[0][0]                    
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 32)            65568       globalaveragepooling2d_1[0][0]   
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 32)            0           dense_1[0][0]                    
____________________________________________________________________________________________________
predictions (Dense)              (None, 3)             99          dropout_1[0][0]                  
====================================================================================================
Total params: 65667
____________________________________________________________________________________________________
None
Found 215 images belonging to 3 classes.
Found 196 images belonging to 3 classes.
Epoch 1/50
4s - loss: 1.5542 - val_loss: 1.4013
Epoch 2/50
2s - loss: 1.1334 - val_loss: 1.3689
Epoch 3/50
2s - loss: 1.1079 - val_loss: 1.2255
Epoch 4/50
2s - loss: 0.8395 - val_loss: 1.1593
Epoch 5/50
2s - loss: 0.8537 - val_loss: 1.1586
Epoch 6/50
2s - loss: 0.7979 - val_loss: 1.0192
Epoch 7/50
2s - loss: 0.6759 - val_loss: 1.0774
Epoch 8/50
2s - loss: 0.5846 - val_loss: 0.9300
Epoch 9/50
2s - loss: 0.6887 - val_loss: 1.0040
Epoch 10/50
2s - loss: 0.5654 - 